#include <stdio.h>

int main()
{
    int a = 10;
    int *pi;
    int **ppi;  // 이중포인터 변수 선언

    pi = &a;    // int형변수의 주소를 저장한 포인터
    ppi = &pi;  // 'int형변수의 주소를 저장한 포인터'의 주소를 저장한 이중포인터

    printf("------------------------------------------------------\n");
    printf("변수 \t 변숫값 \t &연산 \t *연산 \t **연산\n");
    printf("------------------------------------------------------\n");
    printf("  a %12d %12p\n", a, &a);
    printf(" pi %12p %12p %d\n", pi, &pi, *pi);
    printf("ppi %12p %12p %12p %d\n", ppi, &ppi, *ppi, **ppi);
    printf("------------------------------------------------------\n");

    return 0;
}